<a href="https://colab.research.google.com/github/adudars/PedidON/blob/master/arquivos/9.5_InstrucoesAtualizacao%26ExclusaoDados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 9.5 INSTRUÇÕES APLICANDO ATUALIZAÇÃO E EXCLUSÃO DE DADOS

## ESTABELECENDO CONEXÃO

### Instalando bibliotecas de acesso

In [ ]:
#!pip install --user psycopg2-binary
#!pip install --user pandas

### Importando bibliotecas

In [ ]:
import pandas as pd
import psycopg2

### Conectando com o banco através do psycopg2

In [ ]:
conn = psycopg2.connect(host="lallah.db.elephantsql.com", database="nxthbnlu", user="nxthbnlu", password="buyAYKsY17pqexg1grIcJaWm0gHBsO2F")

## ATUALIZAÇÃO

### Funcionário

In [ ]:
cursor_updt_funcionario = conn.cursor()
cursor_updt_funcionario.execute("""update funcionario
                                    set nome_funcionario = 'Matheus Henrique', matricula_funcionario = 5200302
                                    where id_funcionario = 2;""")

In [ ]:
updt_funcionario = pd.read_sql("""select *
                                  from funcionario
                                  where id_funcionario = 2
                                  """,conn)

In [ ]:
updt_funcionario

   id_funcionario  nome_funcionario  matricula_funcionario
0               2  Matheus Henrique                5200302

### Categoria

In [ ]:
cursor_updt_categoria = conn.cursor()
cursor_updt_categoria.execute("""update tamanho
                                set descricao = 'individual'
                                where descricao = '1 pessoa';""")

In [ ]:
updt_categoria = pd.read_sql_query("""select *
                                      from tamanho
                                      where descricao = 'individual'""", conn)

In [ ]:
updt_categoria

   id_tamanho   descricao
0           2  individual

### Preço item

In [ ]:
cursor_updt_item = conn.cursor()
cursor_updt_item.execute("""upadte item_cardapio
                                  set preco = preco * 1.1
                                  where preco = (select min(preco) from item_Cardapio);""")

In [ ]:
updt_item = pd.read_sql_query("""select *
                                from item_cardapio
                                where preco = (select min(preco) from item_Cardapio)""", conn)

In [ ]:
updt_item

   id_itemcardapio      nome_item  ...  fk_id_categoria fk_id_tamanho
0                8  Stella Artois  ...                2             4

[1 rows x 6 columns]

## EXCLUSÃO

### Tamanho

In [ ]:
cursor_dlt_tamanho = conn.cursor()
cursor_dlt_tamanho.execute("""delete from tamanho
                            where descricao = 'infantil'""")

In [ ]:
dlt_tamanho = pd.read_sql_query("""select * from tamanho""", conn)

In [ ]:
dlt_tamanho

   id_tamanho   descricao
0           1   2 pessoas
1           4   long neck
2           5        lata
3           2  individual

### Observação

In [ ]:
cursor_dlt_obs = conn.cursor()
cursor_dlt_obs.execute("""delete from observacao
                            where descricao = 'Porção extra de arroz';""")

In [ ]:
dlt_obs = pd.read_sql_query("""select * from observacao""", conn)

In [ ]:
dlt_obs

   id_obs                    descricao  fk_id_pedido
0       1                      Sem sal             1
1       2      Um prato e talher extra             4
2       3                    Sem nozes             5
3       4                   Sem espuma             7
4       5  Dois copos com gelo e limão             9
5       6          Sem os pães da casa            12
6       7                 Sem maracujá            10
7       8               Servir no copo             8
8      10            Adicionar pimenta            11

### Pedido

In [ ]:
cursor_dlt_pedido = conn.cursor()
cursor_dlt_pedido.execute("""delete from pedido
                                    where id_pedido = 14;""")

In [ ]:
dlt_pedido = pd.read_sql_query("""select * from pedido""", conn)

In [ ]:
dlt_pedido

    id_pedido  quantidade      hora  fk_id_comanda  fk_id_itemcardapio
0           1           2  12:58:00              1                   1
1           2           1  13:19:00              1                   2
2           3           1  12:34:00              2                   3
3           4           3  12:45:00              3                   4
4           5           1  12:45:00              3                   5
5           6           2  13:30:00              3                   6
6           7           1  12:23:00              4                   7
7           8           1  12:37:00              4                   8
8           9           2  13:42:00              5                   9
9          10           1  12:26:00              6                  10
10         11           1  12:57:00              6                   1
11         12           2  12:21:00              7                   2
12         13           3  13:15:00              8                   3
13         15           1  13:02:00              9                   5
14         16           2  13:04:00             10                   6
15         17           3  13:37:00             10                   7
16         18           1  13:49:00             10                   8
17         19           1  12:18:00             11                   9
18         20           1  12:43:00             12                   1
19         21           2  13:09:00             12                   2
20         22           3  13:38:00             13                   3
21         23           4  13:51:00             13                   4
22         24           2  14:23:00             13                   5
23         25           1  14:29:00             13                   6